<template>
  <div class="All">
    <div class="box">
      <h2>سلام دنیا</h2>
      <button type="button" name="button">فورک این محتوا در گیتهاب</button>
    </div>
    <img class="imgintro" src="../assets/Images/white.jpg" alt="Main Blog Photo" height="300" width="620">
    <div class="boxify">
      <p>تاریخ انتشار در اردیبهشت</p>
      <p>دسته بندی عمومی</p>
      <p>نویسنده مهران علم بیگی</p>
    </div>
    <div class="shooted">
      <ol>
        <a href="#why"><li>چرا بلاگ</li></a>
        <a href="#"><li>چرا بلاگ</li></a>
        <a href="#"><li>چرا بلاگ</li></a>
        <a href="#"><li>چرا بلاگ</li></a>
        <a href="#"><li>چرا بلاگ</li></a>
        <a href="#"><li>چرا بلاگ</li></a>
      </ol>
    </div>

    <div class="content">
      <h3 id="why">چرا بلاگ </h3>
      <p>
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
      </p>
      <img src="../assets/Images/white.jpg" alt="Main Blog Photo" height="300" width="620">
      <h3>اصلا برای چی</h3>
      <p>
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
      </p>

    </div>
  </div>
</template>

<script>
export default {
  name : "ThePost"
}
</script>

<style scoped>
.shooted {
  align-self: right;
  border-right: 3px solid #A0BCC2;
  margin: 5%;
}

.shooted ul {
  list-style-type: disc;
  list-style: circle;
}

li{
  display: block;
  color: var(--text-color);
  font-size: 18px;
  margin-right: 2%;
}

li:hover {
  color: #8c9fa3;
}

.All {
  display: flex;
  flex-direction: column;
}

.box {
  display: flex;
  justify-content: space-between;
  margin: 5%;
}

.boxify {
  display: flex;
  justify-content: space-between;
  font-size: 15px;
  width: 620px;
  align-self: center;
}

button {
  margin: 0;
  border: none;
  border-radius: 7px;
  background-color: #d5dcce;
  height: 40px;
  cursor: pointer;
  padding: 10px;
}

.imgintro {
  align-self: center;
  border-radius: 20px;
  margin-bottom: 4%;
}

.content {
  display: flex;
  margin-bottom: 4%;
  flex-direction: column;
  justify-content: space-around;
  padding: 30px;
}

.content img {
  align-self: center;
  border-radius: 20px;
  margin-bottom: 4%;
  margin-top: 4%;
}
</style>
